---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidFamilyType
source: html/e986bee0-54fc-ae8f-d7f6-1d49b3c7dd88.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidFamilyType Property

Invalid family type "[Type Name]".

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidFamilyType { get; }
```